In [1]:
#Toyota data set comma separated value
path = "E:/taxi_data.csv"

In [2]:
import pandas as pd

In [3]:
data = pd.read_csv("E:/taxi_data.csv")

In [4]:
data

          LON       LAT                          NAME
0    28.17858 -25.73882         11th Street Taxi Rank
1    28.17660 -25.73795    81 Bazaar Street Taxi Rank
2    27.83239 -26.53722          Adams Road Taxi Rank
3    28.12514 -26.26666  Alberton City Mall Taxi Rank
4    28.10144 -26.10567      Alexandra Main Taxi Rank
..        ...       ...                           ...
833  27.82999 -26.24445         Zola Clinic Taxi Rank
834  27.83991 -26.24235                Zola Taxi Rank
835  27.86166 -26.23624               Zondi Taxi Rank
836  28.39097 -26.30931            kwaThema Taxi Rank
837       NaN       NaN                           NaN

[838 rows x 3 columns]

In [7]:
data = pd.read_csv("E:/taxi_data.csv" , index_col ="LON")

In [8]:
data

               LAT                          NAME
LON
28.17858 -25.73882         11th Street Taxi Rank
28.17660 -25.73795    81 Bazaar Street Taxi Rank
27.83239 -26.53722          Adams Road Taxi Rank
28.12514 -26.26666  Alberton City Mall Taxi Rank
28.10144 -26.10567      Alexandra Main Taxi Rank
...            ...                           ...
27.82999 -26.24445         Zola Clinic Taxi Rank
27.83991 -26.24235                Zola Taxi Rank
27.86166 -26.23624               Zondi Taxi Rank
28.39097 -26.30931            kwaThema Taxi Rank
NaN            NaN                           NaN

[838 rows x 2 columns]

In [9]:
type(data)

pandas.core.frame.DataFrame

In [10]:
data.shape

(838, 2)

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Float64Index: 838 entries, 28.17858 to nan
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   LAT     837 non-null    float64
 1   NAME    837 non-null    object
dtypes: float64(1), object(1)
memory usage: 19.6+ KB

In [12]:
data.index

Float64Index([          28.17858,            28.1766, 27.832390000000004,
              28.125140000000002, 28.101440000000004,           28.10125,
                        28.10185,           28.10165, 28.101509999999998,
              28.101999999999997,
              ...
                        28.19143, 28.090190000000003,           28.09058,
              28.083109999999998,           28.04441, 27.829990000000002,
              27.839909999999996, 27.861659999999997, 28.390970000000003,
                             nan],
             dtype='float64', name='LON', length=838)

In [13]:
data.columns

Index(['LAT', 'NAME'], dtype='object')

In [14]:
data.head()

               LAT                          NAME
LON
28.17858 -25.73882         11th Street Taxi Rank
28.17660 -25.73795    81 Bazaar Street Taxi Rank
27.83239 -26.53722          Adams Road Taxi Rank
28.12514 -26.26666  Alberton City Mall Taxi Rank
28.10144 -26.10567      Alexandra Main Taxi Rank

In [15]:
data.tail()

               LAT                   NAME
LON
27.82999 -26.24445  Zola Clinic Taxi Rank
27.83991 -26.24235         Zola Taxi Rank
27.86166 -26.23624        Zondi Taxi Rank
28.39097 -26.30931     kwaThema Taxi Rank
NaN            NaN                    NaN

In [16]:
data.head(3)

               LAT                        NAME
LON
28.17858 -25.73882       11th Street Taxi Rank
28.17660 -25.73795  81 Bazaar Street Taxi Rank
27.83239 -26.53722        Adams Road Taxi Rank

In [20]:
data[['LAT','NAME']].head(10)

               LAT                          NAME
LON
28.17858 -25.73882         11th Street Taxi Rank
28.17660 -25.73795    81 Bazaar Street Taxi Rank
27.83239 -26.53722          Adams Road Taxi Rank
28.12514 -26.26666  Alberton City Mall Taxi Rank
28.10144 -26.10567      Alexandra Main Taxi Rank
28.10125 -26.10605      Alexandra Main Taxi Rank
28.10185 -26.10537      Alexandra Main Taxi Rank
28.10165 -26.10479           Alexandra Taxi Rank
28.10151 -26.10594           Alexandra Taxi Rank
28.10200 -26.10576           Alexandra Taxi Rank

In [21]:
### Data Wrangling (Working With Null Values)
data.isnull().sum()

LAT     1
NAME    1
dtype: int64

In [22]:
data.dropna(inplace=True) # removed the null values 1st method remove rows when large data we having
data.isnull().sum()

LAT     0
NAME    0
dtype: int64

In [23]:
data.shape

(837, 2)

In [24]:
data.head(10)

               LAT                          NAME
LON
28.17858 -25.73882         11th Street Taxi Rank
28.17660 -25.73795    81 Bazaar Street Taxi Rank
27.83239 -26.53722          Adams Road Taxi Rank
28.12514 -26.26666  Alberton City Mall Taxi Rank
28.10144 -26.10567      Alexandra Main Taxi Rank
28.10125 -26.10605      Alexandra Main Taxi Rank
28.10185 -26.10537      Alexandra Main Taxi Rank
28.10165 -26.10479           Alexandra Taxi Rank
28.10151 -26.10594           Alexandra Taxi Rank
28.10200 -26.10576           Alexandra Taxi Rank

In [25]:
#2nd method handling missing values
data['LAT'].mean()

-26.145756821983316

In [26]:
import numpy as np

In [27]:
data['LAT'].replace(np.NaN,data['LAT'].mean()).head()

LON
28.17858   -25.73882
28.17660   -25.73795
27.83239   -26.53722
28.12514   -26.26666
28.10144   -26.10567
Name: LAT, dtype: float64